In [1]:
import numpy as np
import pandas as pd
#import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('http://virtualfif.uaq.mx/diplomado/data/student.csv')

In [3]:
df.head()

   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232 entries, 0 to 231
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_id  232 non-null    int64
 1   Age         232 non-null    int64
 2   Gender      232 non-null    object
 3   Grade       232 non-null    object
 4   Employed    232 non-null    object
dtypes: int64(2), object(3)
memory usage: 9.2+ KB

In [5]:
df_categoricas = df.select_dtypes(exclude=np.number)

In [6]:
df_categoricas.head()

   Gender      Grade Employed
0    Male  1st Class      yes
1  Female  2nd Class       no
2    Male  1st Class       no
3  Female  2nd Class       no
4    Male  1st Class       no

In [7]:
df_categoricas['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [8]:
df_categoricas['Grade'].unique()

array(['1st Class', '2nd Class', '3rd Class'], dtype=object)

In [9]:
df_categoricas['Employed'].unique()

array(['yes', 'no'], dtype=object)

In [10]:
df_categoricas.Gender.value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [11]:
df_categoricas.Grade.value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [12]:
df_categoricas.Employed.value_counts()

no     133
yes     99
Name: Employed, dtype: int64

In [13]:
df_categoricas.Gender.replace({'Male': 0, 'Female':1}, inplace=True)

In [14]:
df_categoricas.Grade.replace({'1st Class':1, '2nd Class':2, '3rd Class':3}, inplace=True)

In [15]:
df_categoricas.Employed.replace({'no':0, 'yes':1}, inplace=True)

In [16]:
df_categoricas.head()

   Gender  Grade  Employed
0       0      1         1
1       1      2         0
2       0      1         0
3       1      2         0
4       0      1         0